
&НаКлиенте
Процедура ТовартаблицаЦенаПриИзменении(Элемент)
	Эл = Элементы.Товартаблица.ТекущиеДанные;
	Эл.Сумма = Эл.Цена * Эл.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура ТовартаблицаКоличествоПриИзменении(Элемент)   
	
	Эл = Элементы.Товартаблица.ТекущиеДанные;
	
	Если Объект.Приоритет = ПредопределенноеЗначение("Перечисление.Приоритет.Высокий") Тогда
		Эл.Сумма = (Эл.Цена * Эл.Количество)* 1.2;  
	ИначеЕсли
		Объект.Приоритет = ПредопределенноеЗначение("Перечисление.Приоритет.Стандарт") Тогда
        Эл.Сумма = (Эл.Цена * Эл.Количество)   
	Иначе
		Сообщить("Неверное значение!") 
		 
Конецесли   

 	
	
КонецПроцедуры

&НаКлиенте
Процедура ТовартаблицаСтавкаНДСПриИзменении(Элемент)
	Эл =  Элементы.Товартаблица.ТекущиеДанные;
	Эл.ЦенаСНДС = (Эл.Цена * Эл.СтавкаНДС); 
	
		//Если Перечисления.Приоритет = "Высокий" Тогда
	//	Эл.Сумма = Эл.Цена * Эл.Количество* 2;
	//ИначеЕсли
	//	Эл.Приоритет - "Стандарт" Тогда
	//	Эл.Сумма = Эл.Цена * Эл.Количество;
	//КонецЕсли
	//
		
КонецПроцедуры  


