
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗанятостьСотрудников
//	Движения.ЗанятостьСотрудников.Записывать = Истина;
	//Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		//Движение = Движения.ЗанятостьСотрудников.Добавить();
		//Движение.Период = Дата;
		//Движение.Клиенты = ФИОСотрудника;
		//Движение.Занятость = СтатусСотрудника;
	//КонецЦикла;
                
	// регистр ВзятыеЗаказы 
	Движения.Заказы.Записывать = Истина;
	Движение = Движения.Заказы.Добавить();
	Движение.Период = Дата;
	//Движение.Сотрудники = ФИОСотрудника;
	Движение.СтоимостьЗаказов = ОбщаяСтоимость;
КонецПроцедуры
